zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxa/pinctrl/MCXA567VLL-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MCXA567VLL/signal_configuration.xml
 *
 * 
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MCXA577VPN-pinctrl.h with this part's differences applied
 * below (399 removed, 0 changed,
 * 0 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 47bd448f730443d5
 */

#ifndef _ZEPHYR_DTS_BINDING_MCXA567VLL_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MCXA567VLL_WRAPPER_

#include "MCXA577VPN-pinctrl.h"

/* Signals not present on this part */
#undef ADC0_A10_P0_14
#undef ADC0_A11_P0_15
#undef ADC1_A14_P1_16
#undef ADC1_A15_P1_17
#undef ADC1_A16_P1_18
#undef ADC1_A17_P1_19
#undef CAN0_RXD_P1_19
#undef CAN0_TXD_P1_18
#undef CAN1_RXD_P1_16
#undef CAN1_TXD_P1_17
#undef CMP0_INP5_P2_23
#undef CT0_MAT0_P0_10
#undef CT0_MAT0_P0_24
#undef CT0_MAT1_P0_11
#undef CT0_MAT1_P0_25
#undef CT0_MAT2_P0_12
#undef CT0_MAT2_P0_26
#undef CT0_MAT2_P0_4
#undef CT0_MAT3_P0_13
#undef CT0_MAT3_P0_27
#undef CT0_MAT3_P0_5
#undef CT2_MAT0_P3_18
#undef CT2_MAT1_P3_19
#undef CT2_MAT2_P2_22
#undef CT2_MAT2_P3_20
#undef CT2_MAT3_P2_23
#undef CT2_MAT3_P3_21
#undef CT3_MAT0_P1_18
#undef CT3_MAT0_P2_8
#undef CT3_MAT0_P4_10
#undef CT3_MAT1_P1_19
#undef CT3_MAT1_P2_9
#undef CT3_MAT1_P3_27
#undef CT3_MAT1_P4_11
#undef CT3_MAT2_P2_10
#undef CT3_MAT2_P2_18
#undef CT3_MAT2_P4_12
#undef CT3_MAT3_P2_11
#undef CT3_MAT3_P4_13
#undef CT4_MAT0_P3_2
#undef CT4_MAT1_P3_3
#undef CT4_MAT2_P2_14
#undef CT_INP0_P0_8
#undef CT_INP10_P2_26
#undef CT_INP10_P3_22
#undef CT_INP11_P3_23
#undef CT_INP12_P1_16
#undef CT_INP13_P1_17
#undef CT_INP13_P3_27
#undef CT_INP14_P3_26
#undef CT_INP15_P3_25
#undef CT_INP16_P3_24
#undef CT_INP18_P3_4
#undef CT_INP19_P3_5
#undef CT_INP1_P0_9
#undef CT_INP2_P0_14
#undef CT_INP3_P0_15
#undef CT_INP3_P0_7
#undef CT_INP4_P4_0
#undef CT_INP5_P4_1
#undef CT_INP8_P2_24
#undef CT_INP8_P4_8
#undef CT_INP9_P2_25
#undef CT_INP9_P4_9
#undef ENET0_COL_P1_18
#undef ENET0_CRS_P1_19
#undef ENET0_RXD2_P1_16
#undef ENET0_RXD3_P1_17
#undef ESPI0_CLK_P3_16
#undef ESPI0_CLK_P4_10
#undef ESPI0_CSN_P3_17
#undef ESPI0_CSN_P4_11
#undef ESPI0_DATA0_P3_15
#undef ESPI0_DATA0_P4_9
#undef ESPI0_DATA1_P3_14
#undef ESPI0_DATA1_P4_8
#undef ESPI0_DATA2_P3_13
#undef ESPI0_DATA2_P4_13
#undef ESPI0_DATA3_P3_12
#undef ESPI0_DATA3_P4_12
#undef ESPI0_NOTIFY_P3_20
#undef ESPI0_NOTIFY_P4_7
#undef ESPI0_RST_P3_21
#undef ESPI0_RST_P4_6
#undef EWM0_IN_P0_4
#undef EWM0_OUT_B_P0_5
#undef FLEXIO0_D0_P0_8
#undef FLEXIO0_D10_P3_2
#undef FLEXIO0_D11_P3_3
#undef FLEXIO0_D12_P3_4
#undef FLEXIO0_D13_P3_5
#undef FLEXIO0_D16_P2_8
#undef FLEXIO0_D16_P4_8
#undef FLEXIO0_D17_P2_9
#undef FLEXIO0_D17_P4_9
#undef FLEXIO0_D18_P2_10
#undef FLEXIO0_D18_P4_10
#undef FLEXIO0_D19_P2_11
#undef FLEXIO0_D19_P4_11
#undef FLEXIO0_D1_P0_9
#undef FLEXIO0_D22_P2_14
#undef FLEXIO0_D24_P1_16
#undef FLEXIO0_D24_P3_24
#undef FLEXIO0_D25_P1_17
#undef FLEXIO0_D25_P3_25
#undef FLEXIO0_D26_P1_18
#undef FLEXIO0_D26_P2_18
#undef FLEXIO0_D26_P3_18
#undef FLEXIO0_D26_P3_26
#undef FLEXIO0_D27_P1_19
#undef FLEXIO0_D27_P3_19
#undef FLEXIO0_D27_P3_27
#undef FLEXIO0_D28_P3_20
#undef FLEXIO0_D29_P3_21
#undef FLEXIO0_D2_P0_10
#undef FLEXIO0_D30_P2_22
#undef FLEXIO0_D30_P3_22
#undef FLEXIO0_D31_P2_23
#undef FLEXIO0_D31_P3_23
#undef FLEXIO0_D3_P0_11
#undef FLEXIO0_D4_P0_12
#undef FLEXIO0_D4_P0_4
#undef FLEXIO0_D5_P0_13
#undef FLEXIO0_D5_P0_5
#undef FLEXIO0_D6_P0_14
#undef FLEXIO0_D7_P0_15
#undef FLEXIO0_D7_P0_7
#undef FLEXIO0_D8_P4_0
#undef FLEXIO0_D9_P4_1
#undef FREQME_CLK_IN0_P1_18
#undef FREQME_CLK_IN1_P1_19
#undef I3C1_SCL_P1_17
#undef I3C1_SDA2_P1_19
#undef I3C1_SDA3_P1_18
#undef I3C1_SDA_P1_16
#undef I3C2_PUR_P4_0
#undef I3C2_PUR_P4_12
#undef I3C3_PUR_P4_1
#undef I3C3_PUR_P4_13
#undef LPI2C3_HREQ_P3_24
#undef LPI2C3_HREQ_P3_3
#undef LPI2C3_SCLS_P3_22
#undef LPI2C3_SCLS_P3_5
#undef LPI2C3_SCLS_P4_12
#undef LPI2C3_SCL_P3_21
#undef LPI2C3_SCL_P3_27
#undef LPI2C3_SCL_P4_1
#undef LPI2C3_SDAS_P3_23
#undef LPI2C3_SDAS_P3_4
#undef LPI2C3_SDAS_P4_13
#undef LPI2C3_SDA_P3_20
#undef LPI2C3_SDA_P4_0
#undef LPI2C4_HREQ_P0_11
#undef LPI2C4_HREQ_P4_13
#undef LPI2C4_SCLS_P0_13
#undef LPI2C4_SCLS_P1_17
#undef LPI2C4_SCLS_P4_9
#undef LPI2C4_SCL_P0_14
#undef LPI2C4_SCL_P1_18
#undef LPI2C4_SCL_P4_10
#undef LPI2C4_SDAS_P0_12
#undef LPI2C4_SDAS_P1_16
#undef LPI2C4_SDAS_P4_8
#undef LPI2C4_SDA_P0_15
#undef LPI2C4_SDA_P1_19
#undef LPI2C4_SDA_P4_11
#undef LPSPI1_PCS1_P3_2
#undef LPSPI2_PCS1_P4_0
#undef LPSPI3_PCS0_P3_23
#undef LPSPI3_PCS1_P3_26
#undef LPSPI3_PCS2_P3_25
#undef LPSPI3_PCS3_P3_24
#undef LPSPI3_SCK_P3_21
#undef LPSPI3_SDI_P3_22
#undef LPSPI3_SDO_P3_20
#undef LPSPI4_PCS0_P3_5
#undef LPSPI4_PCS1_P0_14
#undef LPSPI4_PCS1_P3_26
#undef LPSPI4_PCS2_P0_13
#undef LPSPI4_PCS2_P3_25
#undef LPSPI4_PCS3_P0_12
#undef LPSPI4_PCS3_P3_24
#undef LPSPI4_SCK_P3_3
#undef LPSPI4_SDI_P3_4
#undef LPSPI4_SDO_P3_2
#undef LPSPI5_PCS0_P4_11
#undef LPSPI5_PCS1_P1_18
#undef LPSPI5_PCS1_P4_1
#undef LPSPI5_PCS2_P1_17
#undef LPSPI5_PCS2_P4_13
#undef LPSPI5_PCS3_P1_16
#undef LPSPI5_PCS3_P4_12
#undef LPSPI5_SCK_P4_10
#undef LPSPI5_SDI_P4_8
#undef LPSPI5_SDO_P4_9
#undef LPUART0_CTS_B_P4_11
#undef LPUART0_RTS_B_P4_10
#undef LPUART0_RXD_P4_8
#undef LPUART0_TXD_P4_9
#undef LPUART1_CTS_B_P3_23
#undef LPUART1_RTS_B_P3_22
#undef LPUART1_RXD_P3_20
#undef LPUART1_TXD_P3_21
#undef LPUART2_RXD_P2_11
#undef LPUART2_TXD_P2_10
#undef LPUART4_RXD_P3_18
#undef LPUART4_TXD_P3_19
#undef LPUART4_TXD_P3_27
#undef LPUART5_CTS_B_P0_27
#undef LPUART5_CTS_B_P1_19
#undef LPUART5_RTS_B_P0_26
#undef LPUART5_RTS_B_P1_18
#undef LPUART5_RXD_P0_24
#undef LPUART5_RXD_P1_16
#undef LPUART5_TXD_P0_25
#undef LPUART5_TXD_P1_17
#undef P0_10
#undef P0_11
#undef P0_12
#undef P0_13
#undef P0_14
#undef P0_15
#undef P0_24
#undef P0_25
#undef P0_26
#undef P0_27
#undef P0_4
#undef P0_5
#undef P0_7
#undef P0_8
#undef P0_9
#undef P1_16
#undef P1_17
#undef P1_18
#undef P1_19
#undef P2_10
#undef P2_11
#undef P2_14
#undef P2_18
#undef P2_22
#undef P2_23
#undef P2_24
#undef P2_25
#undef P2_26
#undef P2_28
#undef P2_29
#undef P2_30
#undef P2_31
#undef P2_8
#undef P2_9
#undef P3_18
#undef P3_19
#undef P3_2
#undef P3_20
#undef P3_21
#undef P3_22
#undef P3_23
#undef P3_24
#undef P3_25
#undef P3_26
#undef P3_27
#undef P3_3
#undef P3_4
#undef P3_5
#undef P4_0
#undef P4_1
#undef P4_10
#undef P4_11
#undef P4_12
#undef P4_13
#undef P4_8
#undef P4_9
#undef P5_7
#undef P5_8
#undef P5_9
#undef SMARTDMA_PIO0_P0_4
#undef SMARTDMA_PIO12_P1_16
#undef SMARTDMA_PIO13_P1_17
#undef SMARTDMA_PIO14_P1_18
#undef SMARTDMA_PIO14_P2_10
#undef SMARTDMA_PIO15_P1_19
#undef SMARTDMA_PIO15_P2_11
#undef SMARTDMA_PIO18_P3_18
#undef SMARTDMA_PIO19_P3_19
#undef SMARTDMA_PIO1_P0_5
#undef SMARTDMA_PIO20_P3_20
#undef SMARTDMA_PIO20_P4_0
#undef SMARTDMA_PIO21_P3_21
#undef SMARTDMA_PIO21_P4_1
#undef SMARTDMA_PIO22_P3_22
#undef SMARTDMA_PIO23_P3_23
#undef SMARTDMA_PIO24_P3_24
#undef SMARTDMA_PIO25_P3_25
#undef SMARTDMA_PIO26_P3_26
#undef SMARTDMA_PIO27_P3_27
#undef SMARTDMA_PIO28_P4_8
#undef SMARTDMA_PIO29_P4_9
#undef SMARTDMA_PIO2_P3_2
#undef SMARTDMA_PIO30_P4_10
#undef SMARTDMA_PIO31_P4_11
#undef SMARTDMA_PIO3_P0_7
#undef SMARTDMA_PIO3_P3_3
#undef SMARTDMA_PIO4_P0_14
#undef SMARTDMA_PIO4_P3_4
#undef SMARTDMA_PIO5_P0_15
#undef SMARTDMA_PIO5_P3_5
#undef TAMPER5_P5_7
#undef TAMPER6_P5_8
#undef TAMPER7_P5_9
#undef TRIG_IN11_P5_7
#undef TRIG_IN4_P2_11
#undef TRIG_IN4_P2_9
#undef TRIG_IN5_P2_26
#undef TRIG_IN5_P4_0
#undef TRIG_OUT0_P3_20
#undef TRIG_OUT1_P3_21
#undef TRIG_OUT3_P2_8
#undef TRIG_OUT5_P2_10
#undef TRIG_OUT5_P2_23
#undef TRIG_OUT6_P2_24
#undef TRIG_OUT7_P2_25
#undef TSI0_CH0_P5_3
#undef TSI0_CH10_P0_22
#undef TSI0_CH11_P0_23
#undef TSI0_CH12_P1_0
#undef TSI0_CH13_P1_1
#undef TSI0_CH14_P1_2
#undef TSI0_CH15_P1_3
#undef TSI0_CH16_P1_4
#undef TSI0_CH17_P1_5
#undef TSI0_CH18_P1_6
#undef TSI0_CH19_P1_7
#undef TSI0_CH1_P5_4
#undef TSI0_CH20_P1_10
#undef TSI0_CH21_P1_11
#undef TSI0_CH22_P1_12
#undef TSI0_CH23_P1_13
#undef TSI0_CH24_P1_14
#undef TSI0_CH25_P1_15
#undef TSI0_CH26_P1_16
#undef TSI0_CH27_P1_17
#undef TSI0_CH28_P1_18
#undef TSI0_CH29_P1_19
#undef TSI0_CH2_P5_5
#undef TSI0_CH30_P2_0
#undef TSI0_CH31_P2_1
#undef TSI0_CH32_P2_2
#undef TSI0_CH33_P2_3
#undef TSI0_CH34_P2_4
#undef TSI0_CH35_P2_5
#undef TSI0_CH36_P2_6
#undef TSI0_CH37_P2_7
#undef TSI0_CH38_P2_12
#undef TSI0_CH39_P2_13
#undef TSI0_CH3_P5_6
#undef TSI0_CH40_P2_15
#undef TSI0_CH41_P2_16
#undef TSI0_CH42_P2_17
#undef TSI0_CH43_P2_19
#undef TSI0_CH44_P2_20
#undef TSI0_CH45_P2_21
#undef TSI0_CH46_P3_2
#undef TSI0_CH47_P3_3
#undef TSI0_CH48_P3_4
#undef TSI0_CH49_P3_5
#undef TSI0_CH4_P0_16
#undef TSI0_CH50_P3_18
#undef TSI0_CH51_P3_19
#undef TSI0_CH52_P3_20
#undef TSI0_CH53_P3_21
#undef TSI0_CH54_P3_22
#undef TSI0_CH55_P3_23
#undef TSI0_CH56_P3_24
#undef TSI0_CH57_P3_25
#undef TSI0_CH58_P4_0
#undef TSI0_CH59_P4_1
#undef TSI0_CH5_P0_17
#undef TSI0_CH60_P4_2
#undef TSI0_CH61_P4_3
#undef TSI0_CH62_P4_4
#undef TSI0_CH63_P4_5
#undef TSI0_CH64_P4_6
#undef TSI0_CH65_P4_7
#undef TSI0_CH66_P4_8
#undef TSI0_CH67_P4_9
#undef TSI0_CH68_P4_10
#undef TSI0_CH69_P4_11
#undef TSI0_CH6_P0_18
#undef TSI0_CH7_P0_19
#undef TSI0_CH8_P0_20
#undef TSI0_CH9_P0_21
#undef UTICK_CAP0_P0_14
#undef UTICK_CAP1_P0_15
#undef UTICK_CAP2_P0_4
#undef UTICK_CAP3_P0_5
#undef WUU0_IN0_P0_4
#undef WUU0_IN14_P1_16
#undef WUU0_IN15_P1_19
#undef WUU0_IN27_P3_20

#endif /* _ZEPHYR_DTS_BINDING_MCXA567VLL_WRAPPER_ */
